from quiz import Quiz

DEFAULT_QUIZ_DATA = [
    Quiz("'블랙 펜서'의 힘을 얻을 수 있는 허브는?", ["하트 허브", "민트 허브", "블랙 허브", "파워 허브"], 1),
    Quiz("'와칸다'의 광산에서 채굴할 수 있는 것은?", ["묠니르", "인피니티 스톤", "비브라늄", "우라늄"], 3),
    Quiz("다음 중 '블랙 팬서'가 처음으로 등장했던 작품은?", ["<어벤저스: 에이지 오브 울트론>", "<어벤저스: 인피니티 워>", "<캡틴 아메리카: 시빌 워>", "<가디언즈 오브 갤럭시>"], 3),
    Quiz("<블랙 팬서>에서 '블랙 팬서' 티찰라의 사촌 동생으로, 왕위를 노려 티찰라와 결투를 벌이는 인물은?", ["주리", "버키", "킬몽거", "음바쿠"], 3),
    Quiz("'블랙 팬서'의 시그니처 제스쳐와 함께 나오는 구호로 올바른 것은?", ["이범베!", "와칸다 포에버!", "와칸다 어쎔블!", "마예파!"]),
    Quiz("다음 중, 인피니티 스톤과 등장 영화의 연결이 잘못된 것은?", ["파워스톤 - 가디언즈 오브 갤럭시", "타임스톤 - 닥터 스트레인지", "마인드스톤 - 앤트맨", "스페이스 스톤 - 어벤저스"], 3)
]
